# Image Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Reference..::..Image Property
SpecTypeId..::..Reference Class See Also
---
Image, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Image { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Image As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Image {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId..::..Reference Class
Autodesk.Revit.DB Namespace